results/unused/fabio-512-run02/003_fio/cmd_300.output
io_uring_cmd-reference: (g=0): rw=randread, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=io_uring_cmd, iodepth=8
fio-3.32-dirty
Starting 1 thread
{
  "fio version" : "fio-3.32-dirty",
  "timestamp" : 1666790583,
  "timestamp_ms" : 1666790583831,
  "time" : "Wed Oct 26 15:23:03 2022",
  "jobs" : [
    {
      "jobname" : "io_uring_cmd-reference",
      "groupid" : 0,
      "error" : 0,
      "eta" : 0,
      "elapsed" : 11,
      "job options" : {
        "name" : "io_uring_cmd-reference",
        "rw" : "randread",
        "size" : "12G",
        "iodepth" : "8",
        "bs" : "512",
        "direct" : "0",
        "thread" : "1",
        "time_based" : "1",
        "runtime" : "7",
        "ramp_time" : "3",
        "norandommap" : "1",
        "allow_file_create" : "0",
        "ioengine" : "io_uring_cmd",
        "filename" : "/dev/ng0n1",
        "cpus_allowed" : "1"
      },
      "read" : {
        "io_bytes" : 1613466624,
        "io_kbytes" : 1575651,
        "bw_bytes" : 230462308,
        "bw" : 225060,
        "iops" : 450120.554207,
        "runtime" : 7001,
        "total_ios" : 3151294,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 1172,
          "max" : 51907,
          "mean" : 1784.391308,
          "stddev" : 386.919507,
          "N" : 3151295
        },
        "clat_ns" : {
          "min" : 5240,
          "max" : 113272,
          "mean" : 15718.233979,
          "stddev" : 3820.322070,
          "N" : 3151301,
          "percentile" : {
            "1.000000" : 12224,
            "5.000000" : 12736,
            "10.000000" : 13120,
            "20.000000" : 14272,
            "30.000000" : 14784,
            "40.000000" : 14912,
            "50.000000" : 15040,
            "60.000000" : 15424,
            "70.000000" : 15680,
            "80.000000" : 16320,
            "90.000000" : 17280,
            "95.000000" : 18048,
            "99.000000" : 36608,
            "99.500000" : 39168,
            "99.900000" : 48384,
            "99.950000" : 64256,
            "99.990000" : 79360
          }
        },
        "lat_ns" : {
          "min" : 6453,
          "max" : 114505,
          "mean" : 17502.625444,
          "stddev" : 3781.638897,
          "N" : 3151301
        },
        "bw_min" : 224723,
        "bw_max" : 225795,
        "bw_agg" : 100.000000,
        "bw_mean" : 225187.928571,
        "bw_dev" : 301.062085,
        "bw_samples" : 14,
        "iops_min" : 449446,
        "iops_max" : 451591,
        "iops_mean" : 450376.071429,
        "iops_stddev" : 602.094097,
        "iops_samples" : 14
      },
      "write" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "trim" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "sync" : {
        "total_ios" : 0,
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        }
      },
      "job_runtime" : 7000,
      "usr_cpu" : 16.871429,
      "sys_cpu" : 79.900000,
      "ctx" : 15021,
      "majf" : 0,
      "minf" : 0,
      "iodepth_level" : {
        "1" : 0.000000,
        "2" : 0.000000,
        "4" : 0.000000,
        "8" : 100.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_submit" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_complete" : {
        "0" : 0.000000,
        "4" : 99.999968,
        "8" : 0.100000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "latency_ns" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.044109,
        "20" : 96.321670,
        "50" : 3.541847,
        "100" : 0.092248,
        "250" : 0.010000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_ms" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 8,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    }
  ]
}

io_uring_cmd-reference: (groupid=0, jobs=1): err= 0: pid=10082: Wed Oct 26 15:23:03 2022
  read: IOPS=450k, BW=220MiB/s (230MB/s)(1539MiB/7001msec)
    slat (nsec): min=1172, max=51907, avg=1784.39, stdev=386.92
    clat (usec): min=5, max=113, avg=15.72, stdev= 3.82
     lat (usec): min=6, max=114, avg=17.50, stdev= 3.78
    clat percentiles (nsec):
     |  1.00th=[12224],  5.00th=[12736], 10.00th=[13120], 20.00th=[14272],
     | 30.00th=[14784], 40.00th=[14912], 50.00th=[15040], 60.00th=[15424],
     | 70.00th=[15680], 80.00th=[16320], 90.00th=[17280], 95.00th=[18048],
     | 99.00th=[36608], 99.50th=[39168], 99.90th=[48384], 99.95th=[64256],
     | 99.99th=[79360]
   bw (  KiB/s): min=224723, max=225795, per=100.00%, avg=225187.93, stdev=301.06, samples=14
   iops        : min=449446, max=451591, avg=450376.07, stdev=602.09, samples=14
  lat (usec)   : 10=0.04%, 20=96.32%, 50=3.54%, 100=0.09%, 250=0.01%
  cpu          : usr=16.87%, sys=79.90%, ctx=15021, majf=0, minf=0
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3151294,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
   READ: bw=220MiB/s (230MB/s), 220MiB/s-220MiB/s (230MB/s-230MB/s), io=1539MiB (1613MB), run=7001-7001msec